
startM = f'''Уважаемая Манюня Карповна!

    Напиши число в формате a.b
    Где "a" - обычное число
    потом точка "."
    "b" - номер системы, в которую ты хочешь перевести число "a"
    Например, если напишешь "123.8", я найду 123 в 8-ричной системе

Поехали! 🤩🤩🤩'''

helpM1 = f'''Так...🤨 Для особо одарённых!

ЧТОБЫ ПЕРЕВЕСТИ ЧИСЛО ИЗ ДЕСЯТИЧНОЙ СИСТЕМЫ В КАКУЮ-ЛИБО ДРУГУЮ:

Напиши число в формате A.B

→ Где "A" - обычное число
→ потом точка "."
→ "B" - номер системы, в которую ты хочешь перевести число "A"

≫ Например, если напишешь "123.8", я найду 123 в 8-ричной системе'

Ох... Надеюсь, всё понятно! 😅'''


helpM2 = f'''ТАКЖЕ В МОЁМ АРСЕНАЛЕ ПРИСУТСТВУЕТ МЕНЮ ИЗ КНОПОК:

/пэсню - получишь рандомную прекрасную пэсню

/картынку - получишь прекрасную картынку

/хэлп - получишь помощь, ёпт етить

/старт - получишь приветственное сообщение'''

small = ['₀', '₁', '₂', '₃', '₄', '₅', '₆', '₇', '₈', '₉',
'₁₀', '₁₁', '₁₂', '₁₃', '₁₄', '₁₅', '₁₆', '₁₇', '₁₈', '₁₉',
'₂₀', '₂₁', '₂₂', '₂₃', '₂₄', '₂₅', '₂₆', '₂₇', '₂₈', '₂₉', '₃₀']